İleri Birleştirme İşlemleri

In [8]:
import pandas as pd
import numpy as np

In [2]:
#birebir birleştirme

In [3]:
df1 = pd.DataFrame({'çalışanlar': ['Ali','Veli','Ayse','Fatma'],
                   'grup': ['Muhasebe','Muhendislik','Muhendislik','İK']})
df1

  çalışanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [5]:
df2 = pd.DataFrame({'çalışanlar': ['Ayse','Ali','Veli','Fatma'],
                   'ilk_giriş': [2010,2009,2014,2019]})
df2

  çalışanlar  ilk_giriş
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [9]:
pd.merge(df1, df2)

  çalışanlar         grup  ilk_giriş
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [10]:
pd.merge(df1, df2, on = "çalışanlar")

  çalışanlar         grup  ilk_giriş
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [11]:
#Çoktan Teke

In [12]:
df3 = pd.merge(df1,df2)

In [13]:
df3

  çalışanlar         grup  ilk_giriş
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [14]:
df4 = pd.DataFrame({'grup': ['Muhasebe','Muhendislik','İK'],
                   'müdür': ['Caner','Mustafa','Berkcan']})
df4

          grup    müdür
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [15]:
pd.merge(df3,df4)

  çalışanlar         grup  ilk_giriş    müdür
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [16]:
#Çoktan Çoka

In [17]:
df5 = pd.DataFrame({'grup': ['Muhasebe','Muhasebe',
                            'Muhendislik','Muhendislik','İK','İK'],
                   'Yetenekler': ['Matematik', 'excel','kodlama','linux',
                                 'excel','yonetim']})
df5

          grup Yetenekler
0     Muhasebe  Matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [18]:
df1

  çalışanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [19]:
pd.merge(df1,df5)

  çalışanlar         grup Yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim